app/Http/Controllers/products/ProductsController.php

    public function filter(ProductsFilter $filter) {


        return view(
            'shop\showProduct',
                [
                    'products' => Products::ProductsFilter($filter)
                                            ->paginate(10)
                                            ->appends([
                                                'popular' => request('popular'),
                                                'price' => request('price'),
                                                'rangePrice' => request('rangePrice'),
                                                'time' => request('time')
                                            ])
                ]
        );
---
select * from `products` where `price` >= '-1' and `price` <= '9' limit 10 offset 0
select count(*) as aggregate from `products` where `price` >= '-1' and `price` <= '9'
select count(*) as aggregate from `products`